tap "felixkratz/formulae"
tap "fwartner/tap"
tap "koekeishiya/formulae"
brew "openssl@3"
brew "python@3.13"
brew "asitop"
brew "autojump"
brew "bat"
brew "bottom"
brew "btop"
brew "cmake"
brew "curl"
brew "duf"
brew "fd"
brew "fonttools"
brew "fzf"
brew "gcc"
brew "gdu"
brew "gh"
brew "lua"
brew "gping"
brew "graphviz"
brew "htop"
brew "imagemagick"
brew "node"
brew "jupyterlab"
brew "lazygit"
brew "lsd"
brew "ncdu"
brew "neovim"
brew "nowplaying-cli"
brew "pipx"
brew "pkgconf"
brew "pngpaste"
brew "procs"
brew "python@3.12"
brew "python@3.9"
brew "ripgrep"
brew "switchaudio-osx"
brew "texlab"
brew "tmate"
brew "tmux"
brew "typst"
brew "wget"
brew "yarn"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "fwartner/tap/mac-cleanup"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-jetbrains-mono"
cask "font-sf-mono"
cask "font-sf-pro"
cask "ghostty"
cask "kitty"
cask "macs-fan-control"
cask "mactex"
cask "obsidian"
cask "openvpn-connect"
cask "quarto"
cask "raycast"
cask "sf-symbols"
cask "skim"
cask "whatsapp"
cask "zen-browser"
