tap "cmacrae/formulae"
tap "eddieantonio/eddieantonio"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "trashhalo/brews"
tap "zegervdv/zathura"
brew "openssl@1.1"
brew "pcre"
brew "sqlite"
brew "pkg-config"
brew "cairo"
brew "jpeg"
brew "pango"
brew "autoconf"
brew "automake"
brew "bat"
brew "bpytop"
brew "bzip2"
brew "capnp"
brew "clang-format"
brew "cmake"
brew "cmocka"
brew "coreutils"
brew "docker-machine"
brew "exiftool"
brew "libtool"
brew "ffmpeg"
brew "gcc"
brew "hwloc"
brew "fftw"
brew "fzf"
brew "git"
brew "glfw"
brew "go"
brew "ncurses"
brew "htop"
brew "httrack"
brew "jq"
brew "libpcap"
brew "libusb"
brew "libuv"
brew "lolcat"
brew "lsd"
brew "make"
brew "mas"
brew "ninja"
brew "mpv"
brew "nasm"
brew "node"
brew "nativefier"
brew "ncdu"
brew "screenresolution"
brew "neofetch"
brew "neovim"
brew "netcat"
brew "nmap"
brew "openblas"
brew "openssl@3"
brew "openvpn"
brew "p7zip"
brew "php"
brew "pngpaste"
brew "portaudio"
brew "procs"
brew "pstree"
brew "pyenv"
brew "qpdf"
brew "qrencode"
brew "radare2"
brew "rust"
brew "scipy"
brew "shtool"
brew "tmux"
brew "tor"
brew "tty-clock"
brew "wget"
brew "xdotool"
brew "xmrig"
brew "yasm"
brew "youtube-dl"
brew "zlib"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "adoptopenjdk"
cask "alfred"
cask "firefox-nightly"
cask "gcc-arm-embedded"
cask "iina"
cask "macs-fan-control"
cask "mactex"
cask "ngrok"
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Thor", id: 1120999687
