tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "romkatv/powerlevel10k"
tap "zegervdv/zathura"
brew "openssl@1.1"
brew "pcre"
brew "sqlite"
brew "pkg-config"
brew "cairo"
brew "jpeg"
brew "pango"
brew "autoconf"
brew "automake"
brew "bat"
brew "bpytop"
brew "clang-format"
brew "cmake"
brew "cmocka"
brew "docker-machine"
brew "libtool"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "go"
brew "htop"
brew "httrack"
brew "hwloc"
brew "jq"
brew "libpcap"
brew "lsd"
brew "make"
brew "mas"
brew "ninja"
brew "mpv"
brew "mupdf"
brew "ncdu"
brew "screenresolution"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "node"
brew "openblas"
brew "openvpn"
brew "pngpaste"
brew "pstree"
brew "pwntools"
brew "qrencode"
brew "radare2"
brew "ranger"
brew "scipy"
brew "shtool"
brew "sshtrix"
brew "tmux"
brew "tor"
brew "tty-clock"
brew "wget"
brew "xdotool"
brew "zsh-autosuggestions"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "zegervdv/zathura/girara", args: ["HEAD"]
brew "zegervdv/zathura/zathura", args: ["HEAD"]
brew "zegervdv/zathura/zathura-pdf-mupdf"
cask "adoptopenjdk"
cask "alfred"
cask "amethyst"
cask "firefox-nightly"
cask "keycastr"
cask "mactex"
cask "ngrok"
cask "pock"
