tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
# Linux/OSX/FreeBSD resource monitor
brew "bpytop"
# Manage compile and link flags for libraries
brew "pkg-config"
# Vector graphics library with cross-device output support
brew "cairo"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Create Docker hosts locally and on cloud providers
brew "docker-machine"
# Image manipulation library
brew "jpeg"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Terminal file manager
brew "lf"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Get, set, and list display resolution
brew "screenresolution"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Optimized BLAS library
brew "openblas"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Framework for layout and rendering of i18n text
brew "pango"
# Paste PNG into files
brew "pngpaste"
# Show ps output as a tree
brew "pstree"
# CTF framework used by Gallopsled in every CTF
brew "pwntools"
# QR Code generation
brew "qrencode"
# Reverse engineering framework
brew "radare2"
# File browser
brew "ranger"
# SSH login cracker
brew "sshtrix"
# Terminal multiplexer
brew "tmux"
# Anonymizing overlay network for TCP
brew "tor"
# Digital clock in ncurses
brew "tty-clock"
# Internet file retriever
brew "wget"
# Fake keyboard/mouse input and window management for X
brew "xdotool"
cask "adoptopenjdk"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Web browser
cask "firefox-nightly"
cask "font-hack-nerd-font"
cask "font-inconsolata-nerd-font"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Thor", id: 1120999687
